system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
//   (0     0                    -100)   // 0

//   (3.6  -0.15717942211764708  -100)   // 1
//   (3.6   0.15717942211764708  -100)   // 2

//   (3.85 -0.168094659764705905 -100)   // 3
//   (3.85  0.168094659764705905 -100)   // 4

//   (9.1  -0.39731465035294123  -100)   // 5
//   (9.1   0.39731465035294123  -100)   // 6

   (0     0                     0)     //  0       7

   (3.6  -0.15717942211764708   0)     // 1        8
   (3.6   0.15717942211764708   0)     // 2        9

   (3.85 -0.168094659764705905  0)     // 3        10
   (3.85  0.168094659764705905  0)     // 4        11

   (9.1  -0.39731465035294123   0)     // 5        12
   (9.1   0.39731465035294123   0)     // 6        13


   (150  -6.549142588235295     0)     // 7        14
   (150   6.549142588235295     0)     // 8        15

   (0     0                     600)   // 9        16

   (3.6  -0.15717942211764708   600)   // 10       17
   (3.6   0.15717942211764708   600)   // 11       18

   (3.85 -0.168094659764705905  600)   // 12       19
   (3.85  0.168094659764705905  600)   // 13       20

   (9.1  -0.39731465035294123   600)   // 14       21
   (9.1   0.39731465035294123   600)   // 15       22

   (150  -6.549142588235295     600)   // 16       23
   (150   6.549142588235295     600)   // 17       24
);

blocks
(
//    hex ( 0  1  2  0  7  8  9  7)   (5  1 20)   simpleGrading (1 1 1)
//    hex ( 3  5  6  4 10 12 13 11)   (5  1 20)   simpleGrading (1 1 1)

    hex ( 0 1 2 0 9 10 11 9)   (20  1 300)   simpleGrading (1 1 2)
    hex ( 1 3 4 2 10 12 13 11)   (1  1 300)   simpleGrading (1 1 2)
    hex (3 5 6 4 12 14 15 13)   (21  1 300)   simpleGrading (1 1 2)
    hex (5 7 8 6 14 16 17 15)   (120 1 300)   simpleGrading (2 1 2)
);

boundary
(
    inletCH4
    {
        type patch;
        faces
        (
            (1 0 0 2)
        );
    }

    wallOutside
    {
        type wall;
        faces
        (
            (7 8 17 16)
        );
    }

    wallTube
    {
        type wall;
        faces
        (
            (3 1 2 4)
        );
    }

    inletPilot
    {
        type patch;
        faces
        (
            (5 3 4 6)
        );
    }

    inletAir
    {
        type patch;
        faces
        (
            (7 5 6 8)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (9 10 11 9)
            (10 12 13 11)
            (12 14 15 13)
            (14 16 17 15)
        );
    }

    axis
    {
        type empty;
        faces
        (
            (0 9 9 0)
        );
    }

    frontAndBack_pos
    {
        type wedge;
        faces
        (

            (2 0 9 11)
            (4 2 11 13)
            (6 4 13 15)
            (8 6 15 17)
        );
    }

    frontAndBack_neg
    {
        type wedge;
        faces
        (

            (0 1 10 9)
            (1 3 12 10)
            (3 5 14 12)
            (5 7 16 14)
        );
    }
);

// ************************************************************************* //
