constant/scalingParams
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.1.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/ 
FoamFile                                                                       
{   
    version     2.0;                                                           
    format      ascii;          
    class       dictionary;         
    location    "constant";         
    object      tables;             
}                   
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
PVmaxScalingTable
101
(
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
2.883153000000E-01
);
