constant/sparkProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      stochasticFieldsProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sparkHotSpot           off;
sparkCenter            (0.0 0.0 1.0);
sparkBeg               0.0;
sparkDuration          1;
sparkingPV             8; // needs sparking PV from table;
sparkingPVs	       450000; // need to test, jianhong
minSparkingF	       0;//set as 0, jianhong
maxSparkingF	       1;//set as 1, jianhong
sparkingT              2100;//set as 2100, change if needed.jianhong

//for spherical spark
spherSpark             off;
sparkRadi              0.005;

//for box spark
boxSpark               off;
sparkL                 2.0; //spark size in x direction
sparkW                 2.0; //spark size in y direction
sparkH                 2.0; //spark size in z direction
// ************************************************************************* //
