constant/tableProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.3.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/ 
FoamFile                                                                       
{   
    version     2.0;                                                           
    format      ascii;          
    class       dictionary;         
    location    "constant";         
    object      tables;             
}                   
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
mixtureFractionDefinition      "readFromTable";      
interpolationType      linearInterpolation;      
operatingPresure      1e5;      
canteraFileName      "tables/Table";      
PV_param
101
(
4.000000000000E-60
2.894380000000E-03
5.788760000000E-03
8.683140000000E-03
1.157752000000E-02
1.447190000000E-02
1.736628000000E-02
2.026066000000E-02
2.315504000000E-02
2.604942000000E-02
2.894380000000E-02
3.183818000000E-02
3.473256000000E-02
3.762694000000E-02
4.052132000000E-02
4.341570000000E-02
4.631008000000E-02
4.920446000000E-02
5.209884000000E-02
5.499322000000E-02
5.788760000000E-02
6.078198000000E-02
6.367636000000E-02
6.657074000000E-02
6.946512000000E-02
7.235950000000E-02
7.525388000000E-02
7.814826000000E-02
8.104264000000E-02
8.393702000000E-02
8.683140000000E-02
8.972578000000E-02
9.262016000000E-02
9.551454000000E-02
9.840892000000E-02
1.013033000000E-01
1.041976800000E-01
1.070920600000E-01
1.099864400000E-01
1.128808200000E-01
1.157752000000E-01
1.186695800000E-01
1.215639600000E-01
1.244583400000E-01
1.273527200000E-01
1.302471000000E-01
1.331414800000E-01
1.360358600000E-01
1.389302400000E-01
1.418246200000E-01
1.447190000000E-01
1.476133800000E-01
1.505077600000E-01
1.534021400000E-01
1.562965200000E-01
1.591909000000E-01
1.620852800000E-01
1.649796600000E-01
1.678740400000E-01
1.707684200000E-01
1.736628000000E-01
1.765571800000E-01
1.794515600000E-01
1.823459400000E-01
1.852403200000E-01
1.881347000000E-01
1.910290800000E-01
1.939234600000E-01
1.968178400000E-01
1.997122200000E-01
2.026066000000E-01
2.055009800000E-01
2.083953600000E-01
2.112897400000E-01
2.141841200000E-01
2.170785000000E-01
2.199728800000E-01
2.228672600000E-01
2.257616400000E-01
2.286560200000E-01
2.315504000000E-01
2.344447800000E-01
2.373391600000E-01
2.402335400000E-01
2.431279200000E-01
2.460223000000E-01
2.489166800000E-01
2.518110600000E-01
2.547054400000E-01
2.575998200000E-01
2.604942000000E-01
2.633885800000E-01
2.662829600000E-01
2.691773400000E-01
2.720717200000E-01
2.749661000000E-01
2.778604800000E-01
2.807548600000E-01
2.836492400000E-01
2.865436200000E-01
2.894380000000E-01
);

Zeta_param
51
(
0.000000000000E+00
2.000000000000E-02
4.000000000000E-02
6.000000000000E-02
8.000000000000E-02
1.000000000000E-01
1.200000000000E-01
1.400000000000E-01
1.600000000000E-01
1.800000000000E-01
2.000000000000E-01
2.200000000000E-01
2.400000000000E-01
2.600000000000E-01
2.800000000000E-01
3.000000000000E-01
3.200000000000E-01
3.400000000000E-01
3.600000000000E-01
3.800000000000E-01
4.000000000000E-01
4.200000000000E-01
4.400000000000E-01
4.600000000000E-01
4.800000000000E-01
5.000000000000E-01
5.200000000000E-01
5.400000000000E-01
5.600000000000E-01
5.800000000000E-01
6.000000000000E-01
6.200000000000E-01
6.400000000000E-01
6.600000000000E-01
6.800000000000E-01
7.000000000000E-01
7.200000000000E-01
7.400000000000E-01
7.600000000000E-01
7.800000000000E-01
8.000000000000E-01
8.200000000000E-01
8.400000000000E-01
8.600000000000E-01
8.800000000000E-01
9.000000000000E-01
9.200000000000E-01
9.400000000000E-01
9.600000000000E-01
9.800000000000E-01
1.000000000000E+00
);

f_param
201
(
0.000000000000E+00
1.000000000000E-02
2.000000000000E-02
3.000000000000E-02
4.000000000000E-02
5.000000000000E-02
6.000000000000E-02
7.000000000000E-02
8.000000000000E-02
9.000000000000E-02
1.000000000000E-01
1.100000000000E-01
1.200000000000E-01
1.300000000000E-01
1.400000000000E-01
1.500000000000E-01
1.600000000000E-01
1.700000000000E-01
1.800000000000E-01
1.900000000000E-01
2.000000000000E-01
2.100000000000E-01
2.200000000000E-01
2.300000000000E-01
2.400000000000E-01
2.500000000000E-01
2.600000000000E-01
2.700000000000E-01
2.800000000000E-01
2.900000000000E-01
3.000000000000E-01
3.020000000000E-01
3.040000000000E-01
3.060000000000E-01
3.080000000000E-01
3.100000000000E-01
3.120000000000E-01
3.140000000000E-01
3.160000000000E-01
3.180000000000E-01
3.200000000000E-01
3.220000000000E-01
3.240000000000E-01
3.260000000000E-01
3.280000000000E-01
3.300000000000E-01
3.320000000000E-01
3.340000000000E-01
3.360000000000E-01
3.380000000000E-01
3.400000000000E-01
3.420000000000E-01
3.440000000000E-01
3.460000000000E-01
3.480000000000E-01
3.500000000000E-01
3.520000000000E-01
3.540000000000E-01
3.560000000000E-01
3.580000000000E-01
3.600000000000E-01
3.620000000000E-01
3.640000000000E-01
3.660000000000E-01
3.680000000000E-01
3.700000000000E-01
3.720000000000E-01
3.740000000000E-01
3.760000000000E-01
3.780000000000E-01
3.800000000000E-01
3.820000000000E-01
3.840000000000E-01
3.860000000000E-01
3.880000000000E-01
3.900000000000E-01
3.920000000000E-01
3.940000000000E-01
3.960000000000E-01
3.980000000000E-01
4.000000000000E-01
4.020000000000E-01
4.040000000000E-01
4.060000000000E-01
4.080000000000E-01
4.100000000000E-01
4.120000000000E-01
4.140000000000E-01
4.160000000000E-01
4.180000000000E-01
4.200000000000E-01
4.220000000000E-01
4.240000000000E-01
4.260000000000E-01
4.280000000000E-01
4.300000000000E-01
4.320000000000E-01
4.340000000000E-01
4.360000000000E-01
4.380000000000E-01
4.400000000000E-01
4.420000000000E-01
4.440000000000E-01
4.460000000000E-01
4.480000000000E-01
4.500000000000E-01
4.520000000000E-01
4.540000000000E-01
4.560000000000E-01
4.580000000000E-01
4.600000000000E-01
4.620000000000E-01
4.640000000000E-01
4.660000000000E-01
4.680000000000E-01
4.700000000000E-01
4.720000000000E-01
4.740000000000E-01
4.760000000000E-01
4.780000000000E-01
4.800000000000E-01
4.820000000000E-01
4.840000000000E-01
4.860000000000E-01
4.880000000000E-01
4.900000000000E-01
4.920000000000E-01
4.940000000000E-01
4.960000000000E-01
4.980000000000E-01
5.000000000000E-01
5.071428571429E-01
5.142857142857E-01
5.214285714286E-01
5.285714285714E-01
5.357142857143E-01
5.428571428571E-01
5.500000000000E-01
5.571428571429E-01
5.642857142857E-01
5.714285714286E-01
5.785714285714E-01
5.857142857143E-01
5.928571428571E-01
6.000000000000E-01
6.071428571429E-01
6.142857142857E-01
6.214285714286E-01
6.285714285714E-01
6.357142857143E-01
6.428571428571E-01
6.500000000000E-01
6.571428571429E-01
6.642857142857E-01
6.714285714286E-01
6.785714285714E-01
6.857142857143E-01
6.928571428571E-01
7.000000000000E-01
7.071428571429E-01
7.142857142857E-01
7.214285714286E-01
7.285714285714E-01
7.357142857143E-01
7.428571428571E-01
7.500000000000E-01
7.571428571429E-01
7.642857142857E-01
7.714285714286E-01
7.785714285714E-01
7.857142857143E-01
7.928571428571E-01
8.000000000000E-01
8.071428571429E-01
8.142857142857E-01
8.214285714286E-01
8.285714285714E-01
8.357142857143E-01
8.428571428571E-01
8.500000000000E-01
8.571428571429E-01
8.642857142857E-01
8.714285714286E-01
8.785714285714E-01
8.857142857143E-01
8.928571428571E-01
9.000000000000E-01
9.071428571429E-01
9.142857142857E-01
9.214285714286E-01
9.285714285714E-01
9.357142857143E-01
9.428571428571E-01
9.500000000000E-01
9.571428571429E-01
9.642857142857E-01
9.714285714286E-01
9.785714285714E-01
9.857142857143E-01
9.928571428571E-01
1.000000000000E+00
);

