0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:   2.1.0                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform  (0 0 0); 

boundaryField
{
    wallTube
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
//        type            zeroGradient;
        type            pressureInletOutletVelocity;
        value	        $internalField;

    }
    inletPilot
    {
        type            fixedValue;
        value           uniform (0 0 11.4);
    }
    inletAir
    {
        type            fixedValue;
        value           uniform (0 0 0.9);
    }
    wallOutside
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inletCH4
    {
        type            fixedValue;
        value           uniform (0 0 49.6);
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
