0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000; 

boundaryField
{
    wallTube
    {
        type            zeroGradient;
    }
    outlet
    {
        
        /* type            zeroGradient; */
        //  type            fixedValue;
        //  value           uniform 100000;
        type            waveTransmissive;
        phi             phi;
        psi             thermo:psi;
        gamma           1.3;
        fieldInf        1e5;
        lInf            0.7;//0.3;
        value           $internalField;        
    }
    inletPilot
    {        
          type            zeroGradient;
    }
    inletAir
    {
          type            zeroGradient;
    }
    wallOutside
    {
          type            zeroGradient;
    }
    inletCH4
    {
         /* type            fixedValue;
          value           uniform 100000;*/
          type            zeroGradient;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}

// ************************************************************************* //
