0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 30;

boundaryField
{
    wallTube
    {
        type            compressible::kqRWallFunction;
        value           uniform 10;
    }
    outlet
    {
        type            zeroGradient;
    }
    inletPilot
    {
        //type            fixedValue;
        //value           uniform 1;
        
         type            turbulentIntensityKineticEnergyInlet;
         intensity       0.0628;
         value           uniform 1;
    }
    inletAir
    {
       // type            fixedValue;
        // value           uniform 1;
        
       type            turbulentIntensityKineticEnergyInlet;
       intensity       0.0471;
       value           uniform 1;
    }
    wallOutside
    {
        type            compressible::kqRWallFunction;
        value           uniform 10;
    }
    inletCH4
    {
        // type            fixedValue;
        // value           uniform 5;
       type            turbulentIntensityKineticEnergyInlet;
       intensity       0.0458;
       value           uniform 1;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}



// ************************************************************************* //
