0/varf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      varf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0; 

boundaryField
{
    wallTube
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }   
    inletPilot
    {
        type            fixedValue;
        value           uniform 0;
    }
    inletAir
    {
        type            fixedValue;
        value           uniform 0;
    }
    wallOutside
    {
        type            zeroGradient;
    }
    inletCH4
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
